[{"title": "Suzy Shier Fleece Lined Jogger Leggings", "price": "$24.00", "color": "Black", "sizes": "S/M", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "The cool look of joggers mixes with the sleek fit of leggings in this comfy, fleece lined design."},{"title": "Suzy Shier Skinny Jeans with Front Hem Slit", "price": "$39.00", "color": "Dk Denim Blasted", "sizes": "1", "specs": "Model's Size: 3Model's Height: 5'10\"98% cotton, 2% spandexMachine wash in cold water, hang to dryDo not bleach.", "description": "For a little twist on a trendy touch, these cool skinny jeans have their slits in the front of the hems."},{"title": "Suzy Shier Belted Glencheck Crepe Ankle Pants", "price": "$39.00", "color": "Grey", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Get out your classy heels and flaunt the stylish fit of these belted ankle pants in an elegant glencheck print."},{"title": "Suzy Shier Camouflage Leggings", "price": "$24.00", "color": "Dk Green", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"47% cotton, 47% polyester, 6% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Let your edgy side shine through in these cool, camouflage print leggings."},{"title": "Suzy Shier Skinny Pull-on Ankle Pants with Vertical Pockets", "price": "$34.00", "color": "Black", "sizes": "Small", "specs": "Model's Size: SModel's Height: 5'10\" 96% polyester, 4% spandex Hand wash in cold water, hang to dryDo not bleach.", "description": "You need a great fit on an ankle pant that you can wear for all occasions, and this pull-on design, with stylish vertical welt pockets, is the perfect choice."},{"title": "Suzy Shier Pull-on Scuba Leopard Print Pants", "price": "$17.99", "color": "Brown", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 95% polyester, 5% spandex Hand wash in cold water, hang to dryDo not bleach.", "description": "All eyes will be on you when you strut your stuff in these hot, pull-on leopard print pants."},{"title": "Suzy Shier Buffalo Plaid Brushed Leggings", "price": "$18.00", "color": "Mars Red", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "You love plaid on top, and you'll love it just as much on bottom in these bold, buffalo plaid brushed leggings."},{"title": "Suzy Shier Coated Wide Waisted Leggings", "price": "$24.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "These coated leggings will give you a sleek look and a flattering fit due to their comfy wide waist."},{"title": "Suzy Shier Plaid Brushed Leggings", "price": "$18.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "You love plaid on top, and you'll love it just as much on bottom in these cool, plaid brushed leggings."},{"title": "Suzy Shier Navajo Printed Leggings", "price": "$18.00", "color": "Rumba Red", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Give your leggings a trendy western twist with the cool Navajo print on this design."},{"title": "Suzy Shier Belted Pull-on Skinny Pants", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 68% rayon, 27% nylon, 5% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Time to tuck in your stylish tops to show off the belted waist of these flattering pull-on skinny pants."},{"title": "Suzy Shier Wide Waisted Leggings", "price": "$9.99", "color": "Black", "sizes": "Small", "specs": "Model's Size: SModel's Height: 5'10\" 90% cotton, 10% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Lounge comfortably in all colors with this great selection of cozy leggings with a flattering wide waist."},{"title": "Suzy Shier Belted Denim Skirt", "price": "$36.00", "color": "Dk Denim Blue", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"70% cotton, 28% polyester, 2% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "This sleek, jean skirt comes ready with a d-ring belt, so all you need are your cute camis and tees for a cool, summer look."},{"title": "Suzy Shier Sashed Paperbag Ankle Pants", "price": "$36.00", "color": "Black", "sizes": "1", "specs": "Model's Size: 3Model's Height: 5'10\"63% polyester, 34% rayon, 3% spandex Hand wash in cold water, hang to dryDo not bleach", "description": "You have never looked trendier than in these must-have paperbag ankle pants, featuring a convenient sashed front."},{"title": "Suzy Shier High Rise Skinny Jeans with Side Taping", "price": "$49.00", "color": "Dk Denim Blasted", "sizes": "1", "specs": "Model's Size: 3Model's Height: 5'10\"64% cotton, 32% polyester, 2% rayon, 2% spandexMachine wash in cold water, hang to dryDo not bleach", "description": "These flattering skinny jeans give you a cool, retro feel with their high rise fit and contast side taping."},{"title": "Suzy Shier Cropped Pull-on Pants with Contrast Side Band", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 63% polyester, 34% rayon, 3% spandex Hand wash in cold water, hang to dryDo not bleach.", "description": "Create a trendy look with these hot, cropped pants, featuring a retro side band on each leg."},{"title": "Suzy Shier Pull-on Joggers with Side Stripes", "price": "$28.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 80% polyester, 20% cotton Machine wash in cold water, hang to dryDo not bleach.", "description": "In these cool pull-on joggers, with trendy side stripes, you'll be ready for the day, whether you take on the town or the tv."},{"title": "Suzy Shier Pull-on Skinny Pants", "price": "$19.99", "color": "Black", "sizes": "Small", "specs": "Model's Size: SModel's Height: 5'10\" 72% cotton, 23% rayon, 5% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "In the perfect, skinny leg fit, and in a variety of colors to go with all your outfits, these really are the pull-on pants for every occasion."},{"title": "Suzy Shier Sashed Glencheck Hi Low Skirt", "price": "$34.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"65% polyester, 35% rayon Machine wash in cold water, hang to dryDo not bleach", "description": "A chic print makes all the difference, and the classy glencheck plaid on this hi low skirt will create a stunning outfit with a bold tee or sweater."},{"title": "Suzy Shier Striped Pleated Pull-on Pants", "price": "$36.00", "color": "Dk Grey", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 62% polyester, 33% rayon, 5% spandexLining: 100% polyester  Hand wash in cold water, hang to dryDo not bleach.", "description": "Create a trendy look with these chic striped pants with flattering front pleats and an elastic waist which can easily be dressed up for work or down for play."},{"title": "Suzy Shier Skinny Glencheck Ankle Pants with Seam Details", "price": "$39.00", "color": "Grey", "sizes": "Small", "specs": "Model's Size: SModel's Height: 5'10\"53% polyester, 35% rayon, 9% nylon, 3% spandex Hand wash in cold water, hang to dryDo not bleach", "description": "The season is filled with classy glencheck, so elevate your look with this elegant print in these pull-on skinny ankle pants, updated with fake zip pockets and seam details."},{"title": "Suzy Shier Sashed Crepe Pull-on Pants with Wide Legs", "price": "$34.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Hand wash in cold water, hang to dryDo not bleach", "description": "Skinnies are great, but for a classier style, sport these wide-legged crepe pants with a stylish sash."},{"title": "Suzy Shier Crepe Joggers with Side Taping and Zip Pockets", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "We love the revival of everything retro, including these cool joggers featuring side taping, wide legs and trendy zip pockets."},{"title": "Suzy Shier Leggings with 4-stripe Detail", "price": "$12.99", "color": "Grey", "sizes": "S/M", "specs": "Model's Size: S/MModel's Height: 5'10\" 92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Create a cool, retro vibe with these throwback leggings, featuring stripe detailing on the side of each leg."},{"title": "Suzy Shier Seamless Fleece Lined Leggings", "price": "$12.99", "color": "Black", "sizes": "S/M", "specs": "Model's Size: S-MModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Keep wearing your favorite tunic tops all winter when you have these warm and cozy, fleece lined leggings with a seamless fit to pair with them."},{"title": "Suzy Shier Sashed Pleated Crepe Ankle Pants", "price": "$19.99", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 95% polyester, 5% spandex Lining: 100% polyester Hand wash in cold water, hang to dryDo not bleach.", "description": "Whether you throw on comfy sandals or sexy heels, your look will rock with these trendy, crepe ankle pants with front pleats and a sash."},{"title": "Suzy Shier Sashed Pencil Skirt with Button Front", "price": "$36.00", "color": "Ivy", "sizes": "Small", "specs": "Model's Size: XSModel's Height: 5'10\"70% rayon, 26% nylon, 4% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "The flattering fit of this sashed pencil skirt is further complemented by the chic front button detailing."},{"title": "Suzy Shier Pull-on Skinny Pants with Zipper Pockets", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 69% rayon, 27% nylon, 4% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Show off all your cute tops with these classic bottoms; chic skinny pants with trendy vertical zip pockets."},{"title": "Suzy Shier Side Striped Skinny Pants with Exposed Front Zipper", "price": "$39.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"68% rayon, 27% nylon, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "We're giving your classic skinny pants a trendy overhaul by adding retro side stripes and a chic, exposed front zipper to the design."},{"title": "Suzy Shier Skinny Pants with Diagonal Zip Pockets", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\" 68% rayon, 27% nylon, 5% spandex Machine wash in cold water, hang to dryDo not bleach.", "description": "Time to put those shorts away, but you won't mind when you look great in the flattering fit of these skinny pants, featuring diagonal front zip pockets and seam detailing."},{"title": "Suzy Shier Faux Suede Skinny Pants", "price": "$24.99", "color": "In The Buff", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"97% polyester, 3% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Get your chic on by simply opting for these classy faux suede skinny pants, with a side zip and inner elastic waistband, instead of your jeans."},{"title": "Suzy Shier Skinny Jeans with Wide Patterned Belt", "price": "$49.00", "color": "Dk Denim Blasted", "sizes": "1", "specs": "Model's Size: 3Model's Height: 5'10\"70% cotton, 28% polyester, 2% spandexRemove belt before machine wash in cold water, hang to dryDo not bleach", "description": "Not only will you love the smooth fit of these skinny jeans, but the wide, patterned belt that comes with them will give your outfit a trendier twist."},{"title": "Suzy Shier Wide Leg Jeans", "price": "$49.00", "color": "Dk Denim Blue", "sizes": "1", "specs": "Model's Size: XSModel's Height: 5'10\"74% cotton, 25% polyester, 1% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Nothing beats a classic, wide leg pant for a sleek style that your skinnies can't match. Dress them up with an elegant blouse or get a cooler vibe with a pair of sneakers and a tee."},{"title": "Suzy Shier Faux Leather Pencil Skirt with Side Stripes", "price": "$36.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"100% polyurethaneStripes: 84% polyester, 14% rayon, 2% spandexCombo: 95% polyester, 5% spandex  Hand wash in cold water, hang to dryDo not bleach", "description": "We've taken the best that menswear has to offer to inspire this edgy, faux leather pencil skirt, with trendy side stripes to create a fierce silhouette."},{"title": "Suzy Shier Grid Pattern Brushed Leggings", "price": "$18.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Stray from your solids and mix it up a bit with the chic grid pattern on these trendy, brushed leggings."},{"title": "Suzy Shier Fleece Lined Houndstooth Leggings", "price": "$18.00", "color": "Grey", "sizes": "S/M", "specs": "Model's Size: XSModel's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Keep your love of leggings going on all winter with the cozy, fleece lined design of these stylish houndstooth leggings."},{"title": "Suzy Shier Faux Suede Pencil Skirt with Exposed Back Zipper", "price": "$19.99", "color": "Dynasty", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Your sleek pencil skirt is that much classier in chic faux suede with no waistband and a sexy exposed back zipper."},{"title": "Suzy Shier Diamond Skinny Pants with Vertical Zips", "price": "$30.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"85% polyester, 12% rayon, 3% spandex Hand wash in cold water, hang to dryDo not bleach", "description": "If diamonds really are your best friend, then flaunt them on these chic pull-on skinny pants, featuring edgy vertical zip detailing."},{"title": "Suzy Shier Leggings with Front Tie", "price": "$26.00", "color": "Grey", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Your leggings create a much trendier, athleisure outfit with the cool front tie on this design."},{"title": "Suzy Shier Polar Fleece Dandelion Print Pajama Pants", "price": "$18.00", "color": "Lt Grey", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"100% polyester Hand wash in cold water, hang to dryDo not bleach", "description": "Who doesn't love getting cuddly? It's now that much easier in these soft and cozy polar fleece pajama pants in a sweet dandelion print."},{"title": "Suzy Shier Polar Fleece Dotted Pajama Pants", "price": "$18.00", "color": "Pink", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"100% polyester Hand wash in cold water, hang to dryDo not bleach", "description": "Who doesn't love getting cuddly? It's now that much easier in these soft and cozy polar fleece pajama pants in a cute dotted print."},{"title": "Suzy Shier Ruffled Front Skirt with Back Flounce", "price": "$34.00", "color": "Black", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"96% polyester, 4% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Show off your sleek side in this chic skirt, but we didn't forget your flirty side, which is why we added a sweet ruffled front and back flounce to the hem. It features a back zip and inside elastic for the perfect fit."},{"title": "Suzy Shier Chevron Fleece Lined Leggings", "price": "$18.00", "color": "Black", "sizes": "S/M", "specs": "Model's Size: XSModel's Height: 5'10\"90% polyester, 10% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "It's never too cold for stylish leggings when you can flaunt this trendy chevron print in a cozy, fleece lined design."},{"title": "Suzy Shier Navajo Print Leggings", "price": "$18.00", "color": "Merlot", "sizes": "S/M", "specs": "Model's Size: S/M Model's Height: 5'10\"92% polyester, 8% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Give your legs some color and get trendy in these cool, navajo print knit leggings."},{"title": "Suzy Shier Slim Velour Joggers with Side Stripes", "price": "$28.00", "color": "Black", "sizes": "X-Small", "specs": "29\" in-seamModel's Size: XSModel's Height: 5'10\"95% polyester, 5% spandex Machine wash in cold water, hang to dryDo not bleach", "description": "Be warned that when you slip on these soft, cozy velour joggers with contrast side stripes, you'll be more inclined to cuddle up than go for an actual jog."},{"title": "Suzy Shier Chevron Sweater Knit Flippy Skirt", "price": "$29.00", "color": "Black", "sizes": "Small", "specs": "Model's Size: SModel's Height: 5'10\"80% viscose, 20% polyesterHand wash in cold water, hang to dryDo not bleach", "description": "The flattering flippy design gives this chevron print, sweater knit skirt a flirty, feminine feel."},{"title": "Suzy Shier Polar Fleece Star Print Pajama Pants", "price": "$18.00", "color": "Fawn", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"100% polyester Hand wash in cold water, hang to dryDo not bleach", "description": "Who doesn't love getting cuddly? It's now that much easier in these soft and cozy polar fleece pajama pants in a dreamy star print."},{"title": "Suzy Shier Slim Velour Joggers with Drawstring", "price": "$28.00", "color": "Merlot", "sizes": "X-Small", "specs": "Model's Size: XSModel's Height: 5'10\"95% polyester, 5% spandexRibbing: 65% polyester, 35% cotton Machine wash in cold water, hang to dryDo not bleach", "description": "Be warned that when you slip on these soft, cozy velour joggers with a convenient drawstring, you'll be more inclined to cuddle up than go for an actual jog."}]